Revit 2026 API

# IDockablePaneProvider Methods

---

The IDockablePaneProvider type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SetupDockablePane | Method called during initialization of the user interface to gather information about a dockable pane window. |

#### Reference

IDockablePaneProvider Interface

Autodesk.Revit.UI Namespace